Revit 2024 API
BuiltInFailures.RebarSystemFailures.AreaReinforcementsCollision Property
 Area Reinforcements are colliding. Aligning the Major Directions, or changing the Additional Offsets, can prevent collision.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId AreaReinforcementsCollision { get; }
Visual Basic
Public Shared ReadOnly Property AreaReinforcementsCollision As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ AreaReinforcementsCollision {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RebarSystemFailures Class
Autodesk.Revit.DB Namespace